soap_test/book_test.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://commonsws.soa.travelio.xpt.es/">
   <soapenv:Header/>
   <soapenv:Body>
      <com:bookV2>
         <authenticationData>
            <password>pruebas_mex</password>
            <user>pruebas_mex</user>
            <locale>es_ES</locale>
            <domain>intermundial-soaMexico</domain>
         </authenticationData>
         <bookingParams>
            <bookingLines>
               <futureBookingState>IN_AGREEMENT</futureBookingState>
               <departureDate>2020-05-01</departureDate>
               <arrivalDate>2020-05-01</arrivalDate>
               <product>d4d366db-eb0f-4456</product>
               <sellContract>7734dd1c-d10b-414f</sellContract>
               <sellTariff>7699a8cd-9ed0-4353</sellTariff>
               <sellPriceSheet>0880edd1-20ce-44ca</sellPriceSheet>
               <sellCurrency>MXN</sellCurrency>
               <productVariety>default</productVariety>
               <modality>cc7e23e6-1981-4755</modality>
               <adultNumber>1</adultNumber>
			   		<passengers>
              <name>ADRIAN</name>
              <surname>CORTES</surname>
              <age>30</age>
            </passengers>
            </bookingLines>
            <holder>
               <type>NATURAL</type>
               <pid>336412492X</pid>
               <name>ADRIAN</name>
               <surname>CORTES</surname>
               <locale>es_ES</locale>
            </holder>
            <onTheFly>false</onTheFly>
            <thirdReference>34661RT</thirdReference>
         </bookingParams>
      </com:bookV2>
   </soapenv:Body>
</soapenv:Envelope>
